app/services/fetchers/json_fetcher.rb

    def save_merchants(merchants_data)
      raise ArgumentError.new('The JSON data for merchants is not correctly formatted') if merchants_data.nil?

      merchants_data.each do |merchant|
        Merchant.create(
          internal_id: merchant['id'],
          name: merchant['name'],
          email: merchant['email'],
          cif: merchant['cif']
        )
---
INSERT INTO "merchants" ("name", "email", "cif", "internal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Flatley-Rowe"], ["email", "info@flatley-rowe.com"], ["cif", "B611111111"], ["internal_id", 1], ["created_at", "2022-06-12 17:38:11.942710"], ["updated_at", "2022-06-12 17:38:11.942710"]]

    def save_orders(orders_data)
      raise ArgumentError.new('The JSON data for orders is not correctly formatted') if orders_data.nil?

      orders_data.each do |order|
        new_order = Order.create(
          internal_id: order['id'],
          amount: Monetize.parse("€#{order['amount']}"),
          merchant: Merchant.find_by(internal_id: order['merchant_id']),
          order_creation: order['created_at'].to_datetime
        )
---
INSERT INTO "orders" ("order_creation", "order_completion", "merchant_id", "internal_id", "created_at", "updated_at", "amount_cents", "amount_currency", "amount") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "merchants".* FROM "merchants" WHERE "merchants"."internal_id" = $1 LIMIT $2  [["internal_id", 2], ["LIMIT", 1]]