app/controllers/fetch_controller.rb

SELECT "orders".* FROM "orders" ORDER BY "orders"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def show
    merchants_file = File.join(Rails.root, 'public', 'inputs', 'merchants.json')
    orders_file = File.join(Rails.root, 'public', 'inputs', 'orders.json')
    if Order.first.present?